InProgress/multiRegionHeater/0/bottomWater/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomWater";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 0;
    }
    maxX
    {
        type            calculated;
        value           uniform 0;
    }
    minY
    {
        type            calculated;
        value           uniform 0;
    }
    minZ
    {
        type            calculated;
        value           uniform 0;
    }
    maxZ
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWater_to_rightSolid
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWater_to_leftSolid
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWater_to_heater
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
